#+title: k3s-1.rymcg.tech
#+author: EnigmaCurry
#+OPTIONS: ^:{}
#+EXPORT_FILE_NAME: index.html
#+INCLUDE: "~/git/vendor/enigmacurry/literate-k3s/meta/export-html.org"

* Create cluster
Prepare an Ubuntu or Debian node, setup SSH so that your workstation can access
the root account with your key file (use =ssh-keygen= and =ssh-copy-id
root@CLUSTER-DOMAIN= to generate and install key).

Run =apt upgrade= and install =curl= on the server :

#+begin_src shell :noweb yes :eval never-export :results output
cat << EOF | ssh <<CLUSTER_SSH_USER>>@<<CLUSTER>> /bin/bash
sudo apt -qq update && sudo apt -qq upgrade -y && sudo apt install -y curl
EOF
#+end_src

Install [[https://github.com/alexellis/k3sup#readme][k3sup]], then create the cluster:

#+begin_src shell :noweb yes :eval never-export :results none
set -e
mkdir -p ~/.kube
k3sup install --host <<CLUSTER>> --user <<CLUSTER_SSH_USER>> \
  --local-path <<KUBE_CONFIG>> --k3s-extra-args '--disable traefik'
#+end_src

 * Wait a minute or two for the cluster to come up.
 * Now test to see if you can connect and output node status (keep trying until
   it says =Ready=):

#+begin_src shell :noweb yes :eval never-export
kubectl --kubeconfig=<<KUBE_CONFIG>> get nodes
#+end_src

#+RESULTS:
| NAME  | STATUS | ROLES  | AGE | VERSION      |
| k3s-1 | Ready  | master | 65s | v1.19.7+k3s1 |

** Start development server
You can start the server process in a new buffer called =pyapp-uvicorn=:

#+begin_src shell :noweb yes :eval never-export :results none :session pyapp-uvicorn
cd <<SRC_DIR>>/pyapp/pyapp
source env/bin/activate
export PGPASSWORD=$(<<kubectl>> \
  -n postgres get secret/postgres-postgresql \
  -o jsonpath='{.data.postgresql-password}' | base64 -d)
export PGHOST=localhost
export PGDATABASE=<<POSTGRES_DATABASE_NAME>>
export PGUSER=<<POSTGRES_DATABASE_USER>>
poetry update && poetry install && uvicorn main:app --reload &
#+end_src

You can switch to the =pyapp-uvicorn= Emacs buffer to watch the application log
output.

You can test that the service endpoint works, with curl (Try it out multiple
times with a different user agent and/or different name.):

#+begin_src shell :noweb yes :eval never-export :exports both :results output
curl -v -A "my-user-agent" http://127.0.0.1:8000/?name=${USER}
#+end_src

#+RESULTS:
: {"detail":"Not authenticated"}

